Revit 2026 API

# RenderingQualitySettingsRenderLevel Property

---

The render target level as a numerical value between 1 and 40.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int RenderLevel { get; set; }
```
```vb
Public Property RenderLevel As Integer
	Get
	Set
```
```cpp
public:
property int RenderLevel {
	int get ();
	void set (int value);
}
```
```fsharp
member RenderLevel : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The value is not valid for RenderLevel. |
| InvalidOperationException | When setting this property: The RenderingQualitySettings does not use custom quality currently. To use custom quality, set RenderingQuality property to RenderingQuality.Custom. |

Increase this value to increase render level.

#### Reference

RenderingQualitySettings Class

Autodesk.Revit.DB Namespace